const storyData = {
    "park":
      {
        "dialog": "Баш каһарман Айше шәһәр паркында сәяхәт итә иде. Кинәт аның күзләре эскәмиядә утырган Емирга юнәлде. Айше белән Эмир арасында романтик бәйләнеш барлыкка килә башлады.",
        "options": [
          {
            "option": "1",
            "text": "Эмир белән исәнләшеп, үземне таныштырасым килә.",
            "result": "introduce"
          },
          {
            "option": "2",
            "text": "Мин Әмиргә әдәпле елмаярга телим.",
            "result": "smile"
          },
          {
            "option": "3",
            "text": "Эмирга мөрәҗәгать итәр алдыннан бераз озак көтәргә телим.",
            "result": "wait"
          }
        ]
      },
      "introduce":
      {
        "dialog": "Айше кыюлыгын җыйды һәм Эмир янына килде. Ул әйтте: 'Исәнмесез, мин Айше. Син монда нишлисең?' Алар кыска сөйләштеләр, вакыт узу белән алар бер-берсенә якынлаштылар.",
        "options": [
          {
            "option": "1",
            "text": "Мин Эмирга үзем турында күбрәк сөйләргә телим.",
            "result": "tell_more"
          },
          {
            "option": "2",
            "text": "Эмирдан үзе турында күбрәк сөйләвен сорыйсым килә.",
            "result": "ask_more"
          },
          {
            "option": "3",
            "text": "Мин Эмир өчен романтик ишарә ясарга телим.",
            "result": "romantic_gesture"
          }
        ]
      },
      "smile":
      {
        "dialog": "Айше әдәпле елмаеп җибәрде, ә Эмир елмаеп җавап бирде. Алар күз белән бәйләнделәр, романтик атмосфера үсә башлады.",
        "options": [
          {
            "option": "1",
            "text": "Мин Эмирга үзем турында күбрәк сөйләргә телим.",
            "result": "tell_more"
          },
          {
            "option": "2",
            "text": "Эмирдан үзе турында күбрәк сөйләвен сорыйсым килә.",
            "result": "ask_more"
          },
          {
            "option": "3",
            "text": "Мин Эмир өчен романтик ишарә ясарга телим.",
            "result": "romantic_gesture"
          }
        ]
      },
      "wait":
      {
        "dialog": "Айше бераз озаграк көтәргә булды. Эмир аңа якынлашуын көтеп, аңа карауны дәвам итте. Алар икесе дә бер-берсенә тартылган кебек иде.",
        "options": [
          {
            "option": "1",
            "text": "Эмир белән исәнләшеп, үземне таныштырасым килә.",
            "result": "introduce"
          },
          {
            "option": "2",
            "text": "Мин Әмиргә әдәпле елмаярга телим.",
            "result": "smile"
          },
          {
            "option": "3",
            "text": "Эмирга мөрәҗәгать итәр алдыннан бераз озак көтәргә телим.",
            "result": "wait"
          }
        ]
      },
      "tell_more":
      {
        "dialog": "Айше белән Эмир бергә күбрәк вакыт үткәргәндә, аларның мәхәббәте чәчәк ата. Аларның парктагы романтик чыгышлары шәһәрне өйрәнү, көлү һәм хыяллар белән уртаклашу өчен авантюристик сәяхәткә әйләнде.",
        "options": [
          {
            "option": "1",
            "text": "Айше белән Эмир үз бәхетләрен әйтергә карар итәләр.",
            "result": "fortunes_told"
          },
          {
            "option": "2",
            "text": "Алар әдәпле рәвештә баш тартырга һәм көнен дәвам итәргә карар итәләр.",
            "result": "continue_day"
          }
        ]
      },
      "ask_more":
      {
        "dialog": "Айше Эмир турында күбрәк белергә кызыксынуын белдерде. Эмир үзе турында кайбер детальләр белән уртаклашты, аларга бер-берсен яхшырак белергә булышты. Бу сөйләшү аларның бәйләнешен тирәнәйтте.",
        "options": [
          {
            "option": "1",
            "text": "Айше белән Эмир үз бәхетләрен әйтергә карар итәләр.",
            "result": "fortunes_told"
          },
          {
            "option": "2",
            "text": "Алар әдәпле рәвештә баш тартырга һәм көнен дәвам итәргә карар итәләр.",
            "result": "continue_day"
          }
        ]
      },
      "romantic_gesture":
      {
        "dialog": "Айше романтик ишарә ясарга булды. Ул чәчәк белән Эмир янына килде һәм аңа елмаеп бирде. Бәхет белән тулган Эмир аңа татлы ишарә өчен рәхмәт әйтте. Бу романтик акт алар арасындагы химияне тагын да көчәйтте.",
        "options": [
          {
            "option": "1",
            "text": "Айше белән Эмир үз бәхетләрен әйтергә карар итәләр.",
            "result": "fortunes_told"
          },
          {
            "option": "2",
            "text": "Алар әдәпле рәвештә баш тартырга һәм көнен дәвам итәргә карар итәләр.",
            "result": "continue_day"
          }
        ]
      },
      "fortunes_told":
      {
        "dialog": "Кызыксыну Айше белән Эмирның иң яхшысын алды. Алар икесе дә үз бәхетләрен әйтергә ризалаштылар. Күрәзәче кулларын алды, күзләрен йомды һәм бергә киләчәге турында сөйли башлады. Ул мәхәббәт, маҗаралар һәм бәхет белән тулган тормышны алдан әйтә.",
        "options": [
          {
            "option": "1",
            "text": "Алар чатырдан йөзләренә елмаеп, тагын да бәйләнешле һәм бер-берсенә булган мәхәббәтләрен сизәләр.",
            "result": "happy_end"
          }
        ]
      },
      "continue_day":
      {
        "dialog": "Айше һәм Эмир әдәплелек белән тәкъдимнән баш тарттылар, аларның мәхәббәте йолдызларда язылган дип ышанып. Алар кулларын тотып, бүлешкән мизгелләрне кадерләп, көннәрен дәвам иттеләр.",
        "options": [
          {
            "option": "1",
            "text": "Вакыт узу белән аларның мәхәббәт тарихы тирәнәйде, һәм алар мөнәсәбәтләрендә чираттагы адым ясарга булдылар. Алар дуслар һәм туганнар белән әйләндереп алынган матур бакча тантанасында катнаштылар, бер-берсенә тугрылыкларын ныгыттылар.",
            "result": "engagement_end"
          }
        ]
      },
      "happy_end":
      {
        "dialog": "Алар нинди генә юл сайласалар да, Айше белән Эмирның мәхәббәт тарихы мәхәббәт көченә һәм ике йөрәк берлектә тормыш тәкъдим итә алган матур маҗараларга васыять булып калды.",
        "options": null
      },
      "engagement_end":
      {
        "dialog": "Алар нинди генә юл сайласалар да, Айше белән Эмирның мәхәббәт тарихы мәхәббәт көченә һәм ике йөрәк берлектә тормыш тәкъдим итә алган матур маҗараларга васыять булып калды.",
        "options": null
      }
}


export default storyData;